app/controllers/categories_controller.rb

SELECT * FROM `categories` ORDER BY description
---
  def index
    @categories = Category.all(:order => :description)

INSERT INTO `categories` (`created_at`, `updated_at`, `description`) VALUES('2010-09-11 07:02:24', '2010-09-11 07:02:24', 'Kitchen')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save