app/controllers/gifts_controller.rb

SELECT * FROM `categories` ORDER BY description
---
  def index
    @categories = Category.all(:order => :description)

SELECT * FROM `categories` ORDER BY description
---
  def new
    @categories = Category.all(:order => :description).map {|u| [u.description, u.id] }

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 4)
SELECT * FROM `categories` ORDER BY description
---
  def edit
    @gift = Gift.find(params[:id])

    @categories = Category.all(:order => :description).map {|u| [u.description, u.id] }

INSERT INTO `gifts` (`created_at`, `currently_own`, `updated_at`, `is_admin`, `category_id`, `purchased_on`, `description`) VALUES('2010-09-11 07:14:58', 0, '2010-09-11 07:14:58', 0, 1, '2010-09-11', 'fdfds')
---
  def create
    @gift = Gift.new(params[:gift])

    respond_to do |format|
      if @gift.save

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 4)
UPDATE `gifts` SET `updated_at` = '2010-09-11 08:26:13', `category_id` = 5, `description` = 'Tefal Frying Pans (2 off)' WHERE `id` = 16
---
  def update
    @gift = Gift.find(params[:id])

    respond_to do |format|
      if @gift.update_attributes(params[:gift])

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 3)
DELETE FROM `gifts` WHERE `id` = 3
---
  def destroy
    @gift = Gift.find(params[:id])
    @gift.destroy

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 4)
---
  def purchase
    @gift = Gift.find(params[:id])

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 2)
---
  def unpurchase
    @gift = Gift.find(params[:id])